# Flow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..Flow Property
DuctFittingAndAccessoryConnectorData Class See Also
---
The connector flow, Units:(ft³/s)
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Flow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Flow As Double
	Get
```

Visual C++
---
```text
public:
property double Flow {
	double get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace